.emacs.d/jds-config.org
#+TITLE: Jason Sewall's Emacs config
#+OPTIONS: toc:4 h:4


* Configuration
** About this file
:PROPERTIES:
:CUSTOM_ID: babel-init
:END:
<<babel-init>>

I decided to re-set my .emacs file after ~13 years. I'm trying to
follow the basic model of http://sachachua.com/dotemacs.

From Sacha:

If you're new to Emacs Lisp, you probably don't want to copy and paste
large chunks of this code. Instead, copy small parts of it (always
making sure to copy a complete set of parentheses) into your
=*scratch*= buffer or some other buffer in =emacs-lisp-mode=. Use =M-x
eval-buffer= to evaluate the code and see if you like the way that
Emacs behaves. See [[https://www.gnu.org/software/emacs/manual/html_mono/eintr.html][An Introduction to Programming in Emacs Lisp]] for
more details on Emacs Lisp. You can also find the manual by using =C-h
i= (=info=) and choosing "Emacs Lisp Intro".

I've installed a lot of packages. See the [[*Add%20package%20sources][package sources]] section to
add the repositories to your configuration. When you see =use-package=
and a package name you might like, you can use =M-x package-install=
to install the package of that name. Note that use-package is itself
provided by a package, so you'll probably want to install that and
=bind-key=.

If you're viewing the Org file, you can open source code blocks (those
are the ones in begin_src) in a separate buffer by moving your point
inside them and typing C-c ' (=org-edit-special=). This opens another
buffer in =emacs-lisp-mode=, so you can use =M-x eval-buffer= to load
the changes. If you want to explore how functions work, use =M-x
edebug-defun= to set up debugging for that function, and then call it.
You can learn more about edebug in the [[http://www.gnu.org/software/emacs/manual/html_node/elisp/Edebug.html][Emacs Lisp]] manual.

I like using =(setq ...)= more than Customize because I can neatly
organize my configuration that way. Ditto for =use-package= - I mostly
use it to group together package-related config without lots of
=with-eval-after-load= calls, and it also makes declaring keybindings
easier.

My =~/.emacs.d/init.el= is now a symlink to =jds-config.el=, which is
what =M-x org-babel-tangle= (=C-c C-v t=) produces. I create
=jds-config.el= via =org-babel-tangle=.

** Starting up

Get early-init going, if not using emacs 27+

#+begin_src emacs-lisp :tangle yes
(require 'early-init (expand-file-name "early-init" user-emacs-directory))
#+end_src

#+BEGIN_SRC emacs-lisp :tangle yes
  (straight-use-package 'use-package)
#+END_SRC


#+BEGIN_SRC emacs-lisp :tangle yes
  (server-start)
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq inhibit-startup-message t)
#+END_SRC

** Personal information

Who I am

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq user-full-name "Jason Sewall"
        user-mail-address "jasewall@nvidia.com")
#+END_SRC

Where I live

#+begin_src emacs-lisp :tangle yes
  (setq calendar-location-name "Pemaquid, ME")
#+end_src

Time zone

#+begin_src emacs-lisp :tangle yes
  (setq calendar-time-zone (* 60 5)
        calendar-standard-time-zone-name "EST"
        calendar-daylight-time-zone-name "EDT")
#+end_src

** Emacs initialization

*** Add my elisp directory and other files

Sometimes I load files outside the package system. As long as they're
in a directory in my =load-path=, Emacs can find them.

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq use-package-verbose t)
  (use-package auto-compile
    :straight t
    :config (auto-compile-on-load-mode))
  (setq load-prefer-newer t)
#+END_SRC

** General configuration
*** Hydra
Keybinding craziness
#+begin_src emacs-lisp :tangle yes
  (use-package hydra
  :straight t)
#+end_src
*** Flycheck

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package flycheck
    :straight t
    :diminish
    :init (add-hook 'after-init-hook #'global-flycheck-mode))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package flycheck-clang-analyzer
    :straight t
    :after flycheck
    :config (flycheck-clang-analyzer-setup))
#+END_SRC

*** Key-chord
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package key-chord
    :straight t
    :init (key-chord-mode 1))
#+END_SRC

*** Libraries

#+begin_src emacs-lisp :tangle yes
  (use-package dash
    :straight t)
#+end_src

*** Backups

This is one of the things people usually want to change right away. By default, Emacs saves backup files in the current directory. These are the files ending in =~= that are cluttering up your directory lists. The following code stashes them all in =~/.emacs.d/backups=, where I can find them with =C-x C-f= (=find-file=) if I really need to.

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq backup-directory-alist '(("." . "~/.emacs.d/backups")))
#+END_SRC

Disk space is cheap. Save lots.

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq delete-old-versions -1)
  (setq version-control t)
  (setq vc-make-backup-files t)
  (setq auto-save-file-name-transforms '((".*" "~/.emacs.d/auto-save-list/" t)))
#+END_SRC

*** History
From http://www.wisdomandwonder.com/wp-content/uploads/2014/03/C3F.html:
#+BEGIN_SRC emacs-lisp :tangle yes
  (setq savehist-file "~/.emacs.d/savehist")
  (savehist-mode 1)
  (setq history-length t)
  (setq history-delete-duplicates t)
  (setq savehist-save-minibuffer-history 1)
  (setq savehist-additional-variables
        '(kill-ring
          search-ring
          regexp-search-ring))
#+END_SRC
*** Uniquify

Some sanity if we open files with the same name.

#+begin_src emacs-lisp :tangle yes
  (setq uniquify-buffer-name-style 'reverse
        uniquify-after-kill-buffer-p t)
#+end_src
*** Desktop

Save sesions

#+BEGIN_SRC emacs-lisp :tangle yes
  (desktop-save-mode 1)
  (setq desktop-restore-eager 10)
#+END_SRC

Handy hydra for desktop

#+begin_src emacs-lisp :tangle yes
  (defhydra hydra-desktop (:color blue)
    "desktop"
    ("c" desktop-clear "clear")
    ("s" desktop-save "save")
    ("r" desktop-revert "revert")
    ("d" desktop-change-dir "dir"))
#+end_src

*** Windows configuration

Don't give up screen space; we don't need these

#+BEGIN_SRC emacs-lisp :tangle yes
  (tool-bar-mode -1)
  (scroll-bar-mode -1)
#+END_SRC

Don't let butterfingers kill it

#+BEGIN_SRC emacs-lisp :tangle yes
  (when window-system
    (global-unset-key "\C-z"))
  (when window-system
    (global-unset-key "\C-x\C-z"))
#+END_SRC

Informative minibuffer

#+BEGIN_SRC emacs-lisp :tangle yes
  (column-number-mode 1)
  (display-time)
#+END_SRC

Make it harder to accidentally quit

#+BEGIN_SRC emacs-lisp :tangle yes
  (global-unset-key "\C-x\C-c")
  (global-set-key "\C-x\C-c\C-v" 'save-buffers-kill-emacs)
#+END_SRC

Helpful names

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq frame-title-format
        (concat  "emacs@" (system-name)))
  (unless window-system
    (send-string-to-terminal (concat "\ek" frame-title-format "\e\\")))
#+END_SRC

**** Winner

#+begin_src emacs-lisp :tangle yes
  (use-package ace-window
    :straight t)
  (defhydra hydra-window (global-map "C-x w")
    "
  Movement^^        ^Split^         ^Switch^      ^Resize^
  ----------------------------------------------------------------
  _h_ ←         _v_ertical      _b_uffer        _q_ X←
  _j_ ↓         _x_ horizontal  _f_ind files    _w_ X↓
  _k_ ↑         _z_ undo        _a_ce 1     _e_ X↑
  _l_ →         _Z_ reset       _s_wap      _r_ X→
  _F_ollow        _D_lt Other     _S_ave      max_i_mize
  _SPC_ cancel    _o_nly this     _d_elete
  "
    ("h" windmove-left )
    ("j" windmove-down )
    ("k" windmove-up )
    ("l" windmove-right )
    ("q" hydra-move-splitter-left)
    ("w" hydra-move-splitter-down)
    ("e" hydra-move-splitter-up)
    ("r" hydra-move-splitter-right)
    ("F" follow-mode)
    ("a" (lambda ()
	   (interactive)
	   (ace-window 1)
	   (add-hook 'ace-window-end-once-hook
		     'hydra-window/body))
     )
    ("v" (lambda ()
	   (interactive)
	   (split-window-right)
	   (windmove-right))
     )
    ("x" (lambda ()
	   (interactive)
	   (split-window-below)
	   (windmove-down))
     )
    ("s" (lambda ()
	   (interactive)
	   (ace-window 4)
	   (add-hook 'ace-window-end-once-hook
		     'hydra-window/body)))
    ("S" save-buffer)
    ("d" delete-window)
    ("D" (lambda ()
	   (interactive)
	   (ace-window 16)
	   (add-hook 'ace-window-end-once-hook
		     'hydra-window/body))
     )
    ("o" delete-other-windows)
    ("i" ace-maximize-window)
    ("z" (progn
	   (winner-undo)
	   (setq this-command 'winner-undo))
     )
    ("Z" winner-redo)
    ("SPC" nil))
#+end_src

