.emacs.d/jds-config.el
(require 'early-init (expand-file-name "early-init" user-emacs-directory))

(straight-use-package 'use-package)

(server-start)

(setq inhibit-startup-message t)

(setq user-full-name "Jason Sewall"
      user-mail-address "jasewall@nvidia.com")

(setq calendar-latitude 43.8951048
      calendar-longitude -69.525429740
      calendar-location-name "Pemaquid, ME")

(setq calendar-time-zone (* 60 5)
      calendar-standard-time-zone-name "EST"
      calendar-daylight-time-zone-name "EDT")

(setq use-package-verbose t)
(use-package auto-compile
  :straight t
  :config (auto-compile-on-load-mode))
(setq load-prefer-newer t)

(use-package hydra
:straight t)

(use-package flycheck
  :straight t
  :diminish
  :init (add-hook 'after-init-hook #'global-flycheck-mode))

(use-package flycheck-clang-analyzer
  :straight t
  :after flycheck
  :config (flycheck-clang-analyzer-setup))

(use-package key-chord
  :straight t
  :init (key-chord-mode 1))

(use-package dash
  :straight t)

(setq backup-directory-alist '(("." . "~/.emacs.d/backups")))

(setq delete-old-versions -1)
(setq version-control t)
(setq vc-make-backup-files t)
(setq auto-save-file-name-transforms '((".*" "~/.emacs.d/auto-save-list/" t)))

(setq savehist-file "~/.emacs.d/savehist")
(savehist-mode 1)
(setq history-length t)
(setq history-delete-duplicates t)
(setq savehist-save-minibuffer-history 1)
(setq savehist-additional-variables
      '(kill-ring
        search-ring
        regexp-search-ring))

(setq uniquify-buffer-name-style 'reverse
      uniquify-after-kill-buffer-p t)

(desktop-save-mode 1)
(setq desktop-restore-eager 10)

(defhydra hydra-desktop (:color blue)
  "desktop"
  ("c" desktop-clear "clear")
  ("s" desktop-save "save")
  ("r" desktop-revert "revert")
  ("d" desktop-change-dir "dir"))

(tool-bar-mode -1)
(scroll-bar-mode -1)

(when window-system
  (global-unset-key "\C-z"))
(when window-system
  (global-unset-key "\C-x\C-z"))

(column-number-mode 1)
(display-time)

(global-unset-key "\C-x\C-c")
(global-set-key "\C-x\C-c\C-v" 'save-buffers-kill-emacs)

(setq frame-title-format
      (concat  "emacs@" (system-name)))
(unless window-system
  (send-string-to-terminal (concat "\ek" frame-title-format "\e\\")))

(use-package ace-window
  :straight t)
(defhydra hydra-window (global-map "C-x w")
  "
Movement^^        ^Split^         ^Switch^      ^Resize^
----------------------------------------------------------------
_h_ ←         _v_ertical      _b_uffer        _q_ X←
_j_ ↓         _x_ horizontal  _f_ind files    _w_ X↓
_k_ ↑         _z_ undo        _a_ce 1     _e_ X↑
_l_ →         _Z_ reset       _s_wap      _r_ X→
_F_ollow        _D_lt Other     _S_ave      max_i_mize
_SPC_ cancel    _o_nly this     _d_elete
"
  ("h" windmove-left )
  ("j" windmove-down )
  ("k" windmove-up )
  ("l" windmove-right )
  ("q" hydra-move-splitter-left)
  ("w" hydra-move-splitter-down)
  ("e" hydra-move-splitter-up)
  ("r" hydra-move-splitter-right)
  ("F" follow-mode)
  ("a" (lambda ()
	 (interactive)
	 (ace-window 1)
	 (add-hook 'ace-window-end-once-hook
		   'hydra-window/body))
   )
  ("v" (lambda ()
	 (interactive)
	 (split-window-right)
	 (windmove-right))
   )
  ("x" (lambda ()
	 (interactive)
	 (split-window-below)
	 (windmove-down))
   )
  ("s" (lambda ()
	 (interactive)
	 (ace-window 4)
	 (add-hook 'ace-window-end-once-hook
		   'hydra-window/body)))
  ("S" save-buffer)
  ("d" delete-window)
  ("D" (lambda ()
	 (interactive)
	 (ace-window 16)
	 (add-hook 'ace-window-end-once-hook
		   'hydra-window/body))
   )
  ("o" delete-other-windows)
  ("i" ace-maximize-window)
  ("z" (progn
	 (winner-undo)
	 (setq this-command 'winner-undo))
   )
  ("Z" winner-redo)
  ("SPC" nil))
