.emacs.d/jds-config.org
*** Mode line format

Display a more compact mode line

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package smart-mode-line
    :straight t)
#+END_SRC

*** Change "yes or no" to "y or n"

Lazy people like me never want to type "yes" when "y" will suffice.

#+BEGIN_SRC emacs-lisp :tangle yes
  (fset 'yes-or-no-p 'y-or-n-p)
#+END_SRC

*** Minibuffer editing - more space!

Sometimes you want to be able to do fancy things with the text
that you're entering into the minibuffer. Sometimes you just want
to be able to read it, especially when it comes to lots of text.
This binds =C-M-e= in a minibuffer) so that you can edit the
contents of the minibuffer before submitting it.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package miniedit
    :straight t
    :commands minibuffer-edit
    :init (miniedit-install))
#+END_SRC

*** Appearances

Theme

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package zenburn-theme
    :straight t
    :init
    (progn
      (cond
       (window-system (load-theme 'zenburn t))
       (t             (load-theme 'zenburn t)))))
#+END_SRC

Enable visual feedback on selections
#+BEGIN_SRC emacs-lisp :tangle yes
  (setq transient-mark-mode t)
#+END_SRC

Maximum colors

#+BEGIN_SRC emacs-lisp :tangle yes
  (global-font-lock-mode t)
  (setq font-lock-maximum-decoration t)
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes
  (show-paren-mode t)
#+END_SRC

*** Help - guide-key

It's hard to remember keyboard shortcuts. The =guide-key= package pops up help after a short delay.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package guide-key
    :straight t
    :defer t
    :diminish guide-key-mode
    :config
    (progn
      (setq guide-key/guide-key-sequence '("C-x r" "C-x 4" "C-c"))
      (guide-key-mode 1)))  ; Enable guide-key-mode
#+END_SRC

*** Unicode

#+BEGIN_SRC emacs-lisp :tangle yes
  (prefer-coding-system 'utf-8)
  (setq-default buffer-file-coding-system 'utf-8-unix)
  (set-default-coding-systems 'utf-8-unix)
  (setq-default default-buffer-file-coding-system 'utf-8-unix)
  (define-coding-system-alias 'UTF-8 'utf-8)
  (setq read-quoted-char-radix 16)

  (defmacro my/insert-unicode (unicode-name)
    `(lambda () (interactive)
       (insert-char (cdr (assoc-string ,unicode-name (ucs-names))))))

  (when (display-graphic-p)
    (setq x-select-request-type '(UTF8_STRING COMPOUND_TEXT TEXT STRING)))
#+END_SRC

*** Sentences end with a two spaces

Sentences end with a two spaces. This makes
sentence navigation commands work for me.

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq sentence-end-double-space t)
#+END_SRC

*** Expand

#+BEGIN_SRC emacs-lisp :tangle yes
  (bind-key "M-/" 'hippie-expand)
#+END_SRC

From https://github.com/purcell/emacs.d/blob/master/lisp/init-auto-complete.el - Exclude very large buffers from dabbrev
#+BEGIN_SRC emacs-lisp :tangle yes
  (defun sanityinc/dabbrev-friend-buffer (other-buffer)
    (< (buffer-size other-buffer) (* 1 1024 1024)))
  (setq dabbrev-friend-buffer-function 'sanityinc/dabbrev-friend-buffer)
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq hippie-expand-try-functions-list
        '(try-expand-all-abbrevs
          try-complete-file-name-partially
          try-complete-file-name
          try-expand-dabbrev
          try-expand-dabbrev-from-kill
          try-expand-dabbrev-all-buffers
          try-expand-list
          try-expand-line
          try-complete-lisp-symbol-partially
          try-complete-lisp-symbol))
#+END_SRC

*** Diminish

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package diminish
    :straight t
    :init (diminish 'eldoc-mode))
#+END_SRC

*** Powerline

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package powerline
    :straight t
    :config (powerline-default-theme))
#+END_SRC

** System stuff
*** Tramp
Real handy when working on remote machines
#+begin_src emacs-lisp :tangle yes
  (use-package tramp
    :straight (:type built-in)
    :init (setq tramp-unified-filename t))
#+end_src
**** Tramp-term
#+begin_src emacs-lisp :tangle yes
  (use-package tramp-term
    :straight t)
#+end_src
*** Shells
**** Remote term access

This lets me open up terminals. I wish I could get this to work with tramp.

#+begin_src emacs-lisp :tangle yes
  (add-hook 'term-mode-hook
      (lambda ()
        (setq term-buffer-maximum-size 100000)))

  ;; Use this for remote so I can specify command line arguments
  (defun my/remote-term (new-buffer-name cmd &rest switches)
    (setq term-ansi-buffer-name (concat "*" new-buffer-name "*"))
    (setq term-ansi-buffer-name (generate-new-buffer-name term-ansi-buffer-name))
    (setq term-ansi-buffer-name (apply 'make-term term-ansi-buffer-name cmd nil switches))
    (set-buffer term-ansi-buffer-name)
    (term-mode)
    (term-char-mode)
    (let (term-escape-char)
      ;; I wanna have find-file on C-x C-f -mm
      ;; your mileage may definitely vary, maybe it's better to put this in your
      ;; .emacs ...
      (term-set-escape-char ?\C-x))

    (switch-to-buffer term-ansi-buffer-name))

  (use-package pcomplete
    :straight t
    :init (progn (require 'pcmpl-unix) (defun my/ssh-remote-term (hostname)
                                         (interactive (list (completing-read "Hostname: " (pcmpl-ssh-hosts))))
                                         (my/remote-term hostname "ssh" hostname))))

  ;; (defun helm-source-ssh-remote-term ()
  ;;   (helm-build-sync-source "SSH hostname"
  ;;     :candidates (lambda () (pcmpl-ssh-hosts))
  ;;     :filtered-candidate-transformer '(helm-adaptive-sort)
  ;;     :nomark t
  ;;     :action '(("Select host" . my/ssh-remote-term))))

  ;; (defun my/helm-ssh-remote-term ()
  ;;   (interactive)
  ;;   (helm :sources (helm-source-ssh-remote-term)
  ;;         :buffer "*helm-ssh-remote-term*"))

  (defun my/local-term ()
    (interactive)
    (ansi-term "bash" "localhost"))
#+end_src

**** Customize shells
#+begin_src emacs-lisp :tangle yes
  (add-hook 'shell-mode-hook 'ansi-color-for-comint-mode-on)
  (add-hook 'comint-output-filter-functions 'comint-watch-for-password-prompt)
#+end_src
*** Ibuffer
#+begin_src emacs-lisp :tangle yes
  (use-package ibuffer
    :straight t
    :bind (("<f9>" . ibuffer))
    :init (setq ibuffer-shrink-to-minimum-size t
                ibuffer-always-show-last-buffer nil
                ibuffer-sorting-mode 'recency
                ibuffer-use-header-line t))
#+end_src
** Projects & version control
*** Git
I don't know if this is actually necessary
#+begin_src emacs-lisp :tangle yes
  (add-to-list 'vc-handled-backends 'GIT)
#+end_src

#+begin_src emacs-lisp :tangle yes
  (setq vc-follow-symlinks t)
#+end_src
*** Git-link
#+begin_src emacs-lisp :tangle yes
  (use-package git-link
    :straight t
    :init (global-set-key (kbd "C-c m l") 'git-link))
#+end_src
*** YADM
#+begin_src emacs-lisp :tangle yes
  (add-to-list 'tramp-methods
               '("yadm"
                 (tramp-login-program "yadm")
                 (tramp-login-args (("enter")))
                 (tramp-remote-shell "/bin/sh")
                 (tramp-remote-shell-args ("-c"))))
#+end_src
*** Nice diffs
#+begin_src emacs-lisp :tangle yes
  (setq diff-switches "-u")
  (setq vc-diff-switches '("-b" "-B" "-u"))
  (setq vc-git-diff-switches nil)
#+end_src
*** Magit
#+begin_src emacs-lisp :tangle yes
  (use-package magit
    :straight t
    :init (setq magit-auto-revert-mode t)
    :bind (("C-x C-g" . magit-status)))
#+end_src
*** Projects
#+begin_src emacs-lisp :tangle yes
  (use-package projectile
    :straight t
    :diminish projectile-mode
    :config
    (progn
      (setq projectile-keymap-prefix (kbd "C-c p"))
      (setq projectile-completion-system 'default)
      (setq projectile-enable-caching t)
      (setq projectile-indexing-method 'alien)
      (add-to-list 'projectile-globally-ignored-files "node-modules"))
    :config
    (projectile-global-mode))
#+end_src
** Navigation & Search
*** Go to line
#+begin_src emacs-lisp :tangle yes
  (global-set-key "\C-cg" 'goto-line)

  (use-package avy
    :straight t
    :init (defhydra hydra-avy (global-map "M-g" :color blue)
	    "avy-goto"
	    ("c" avy-goto-char "char")
	    ("C" avy-goto-char-2 "char-2")
	    ("w" avy-goto-word-1 "word")
	    ("s" avy-goto-subword-1 "subword")
	    ("u" link-hint-open-link "open-URI")
	    ("U" link-hint-copy-link "copy-URI"))
    :bind (("M-g g" . avy-goto-line)))

  (defhydra hydra-goto-line (goto-map ""
				      :pre (display-line-numbers-mode 1)
				      :post (display-line-numbers-mode -1))
    "goto-line"
    ("g" goto-line "go")
    ("m" set-mark-command "mark" :bind nil)
    ("q" nil "quit"))
#+end_src
*** Lacarte
Navigate menus via keyboard

#+begin_src emacs-lisp :tangle yes
  (use-package lacarte
    :straight t
    :bind (("<f10>" . lacarte-execute-menu-command)))
#+end_src

*** Window movement
Use arrow keys to switch windows (and frames, with X)
#+begin_src emacs-lisp :tangle yes
  (use-package windmove
    :straight t
    :init (windmove-default-keybindings))
  (use-package framemove
    :straight t
    :init (setq framemove-hook-into-windmove t))
  (global-set-key "\M-o" 'other-window)
#+end_src
