.emacs.d/jds-config.org
*** Move to start
#+begin_src emacs-lisp :tangle yes
  (defun my/smarter-move-beginning-of-line (arg)
    "Move point back to indentation of beginning of line.

  Move point to the first non-whitespace character on this line.
  If point is already there, move to the beginning of the line.
  Effectively toggle between the first non-whitespace character and
  the beginning of the line.

  If ARG is not nil or 1, move forward ARG - 1 lines first.  If
  point reaches the beginning or end of the buffer, stop there."
    (interactive "^p")
    (setq arg (or arg 1))

    ;; Move lines first
    (when (/= arg 1)
      (let ((line-move-visual nil))
        (forward-line (1- arg))))

    (let ((orig-point (point)))
      (back-to-indentation)
      (when (= orig-point (point))
        (move-beginning-of-line 1))))

  ;; remap C-a to `smarter-move-beginning-of-line'
  (global-set-key [remap move-beginning-of-line]
                  'my/smarter-move-beginning-of-line)
#+end_src
*** Ripgrep
#+begin_src emacs-lisp :tangle yes
  (use-package rg
    :straight t
    :init (rg-enable-default-bindings))
#+end_src
*** Phi-search
#+begin_src emacs-lisp :tangle yes
  (use-package phi-search
    :straight t
    :diminish phi-search
    :config
    (progn
      (global-set-key (kbd "C-s") 'phi-search)
      (global-set-key (kbd "C-r") 'phi-search-backward)))
#+end_src
** Editing tricks
*** Yasnippet
#+begin_src emacs-lisp :tangle yes
  (use-package yasnippet
    :straight t
    :init (yas-global-mode 1))
#+end_src

*** Which Key
#+begin_src emacs-lisp :tangle yes
  (use-package which-key
    :straight t
    :init (which-key-mode))
#+end_src

*** Aggresive indentation
#+begin_src emacs-lisp :tangle yes
  (use-package aggressive-indent
    :straight t)
#+end_src

*** Multiple cursors
So powerful
#+begin_src emacs-lisp :tangle yes
  (use-package multiple-cursors
    :straight t
    :init (defhydra multiple-cursors-hydra (global-map "C-x m")
	    "
       ^Up^            ^Down^        ^Other^
  ----------------------------------------------
  [_p_]   Next    [_n_]   Next    [_l_] Edit lines
  [_P_]   Skip    [_N_]   Skip    [_a_] Mark all
  [_M-p_] Unmark  [_M-n_] Unmark  [_r_] Mark by regep
  ^ ^             ^ ^             [_i_] Insert numbers
  ^ ^             ^ ^             [_h_] Hide unmatched
  ^ ^             ^ ^             [_s_] Sort regions
  ^ ^             ^ ^             [_q_] Quit
  "
	    ("i" mc/insert-numbers)
	    ("h" mc-hide-unmatched-lines-mode)
	    ("s" mc/sort-regions)
	    ("l" mc/edit-lines :exit t)
	    ("a" mc/mark-all-like-this :exit t)
	    ("n" mc/mark-next-like-this)
	    ("N" mc/skip-to-next-like-this)
	    ("M-n" mc/unmark-next-like-this)
	    ("p" mc/mark-previous-like-this)
	    ("P" mc/skip-to-previous-like-this)
	    ("M-p" mc/unmark-previous-like-this)
	    ("r" mc/mark-all-in-region-regexp :exit t)
	    ("q" nil))
    :bind (("C-^" . set-rectangular-region-anchor)
	   ("M-3" . mc/mark-next-like-this)
	   ("M-4" . mc/mark-previous-like-this)
	   ("M-#" . mc/unmark-next-like-this)
	   ("M-$" . mc/unmark-previous-like-this)))
#+end_src

*** Expand region
#+begin_src emacs-lisp :tangle yes
  (use-package expand-region
    :straight t
    :defer t
    :bind (("M-2" . er/expand-region)))
#+end_src
*** Autocomplete
#+begin_src emacs-lisp :tangle yes
  (use-package company
    :straight t
    :diminish
    :config (global-company-mode))
#+end_src
*** Transpose, but keep whitespace
#+begin_src emacs-lisp :tangle yes
  (defun my/forward-transpose-whitespace (begin end)
    "If mark is active, swap leading whitespace with region between
        point and mark. If mark isn't active, find the first
        non-whitespace character after point and swap it with the
        whitespace before it. To start, place point on character or at
        start of region."
    (interactive "*r")
    (let* ((string-to-be-switched
            (if (use-region-p)
                (delete-and-extract-region begin end)
              (progn
                (skip-chars-forward "[:space:]")
                (delete-and-extract-region (point) (1+ (point))))))
           (right-anchor (point))
           (whitespace
            (progn
              (skip-chars-backward "[:space:]")
              (delete-and-extract-region (point) right-anchor))))
      (insert string-to-be-switched whitespace)))

  (global-set-key (kbd "C-c t") 'my/forward-transpose-whitespace)
#+end_src
*** Unfill paragraph

#+BEGIN_SRC emacs-lisp :tangle yes
  (defun my/unfill-paragraph (&optional region)
    "Takes a multi-line paragraph and makes it into a single line of text."
    (interactive (progn
                   (barf-if-buffer-read-only)
                   (list t)))
    (let ((fill-column (point-max)))
      (fill-paragraph nil region)))
  (bind-key "C-x M-q" 'my/unfill-paragraph)
#+END_SRC

I never actually justify text, so I might as well change the way
=fill-paragraph= works. With the code below, =M-q= will fill the
paragraph normally, and =C-u M-q= will unfill it.

#+BEGIN_SRC emacs-lisp :tangle yes
  (defun my/fill-or-unfill-paragraph (&optional unfill region)
    "Fill paragraph (or REGION).
    With the prefix argument UNFILL, unfill it instead."
    (interactive (progn
                   (barf-if-buffer-read-only)
                   (list (if current-prefix-arg 'unfill) t)))
    (let ((fill-column (if unfill (point-max) fill-column)))
      (fill-paragraph nil region)))
  (bind-key "M-q" 'my/fill-or-unfill-paragraph)
#+END_SRC

Also, =visual-line-mode= is so much better than =auto-fill-mode=. It doesn't actually break the text into multiple lines - it only looks that way.

#+BEGIN_SRC emacs-lisp :tangle yes
  (remove-hook 'text-mode-hook #'turn-on-auto-fill)
  (add-hook 'text-mode-hook 'turn-on-visual-line-mode)
#+END_SRC

*** Whitespace

#+BEGIN_SRC emacs-lisp :tangle yes
  (bind-key "M-SPC" 'cycle-spacing)
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes
  (add-hook 'before-save-hook 'delete-trailing-whitespace)
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package ws-butler
    :straight t
    :init (add-hook 'prog-mode-hook #'ws-butler-mode))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq require-final-newline 't)
#+END_SRC

*** Undo tree mode - visualize your undos and branches

People often struggle with the Emacs undo model, where there's really no concept of "redo" - you simply undo the undo.

This lets you use =C-x u= (=undo-tree-visualize=) to visually walk through the changes you've made, undo back to a certain point (or redo), and go down different branches.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package undo-tree
    :straight t
    :diminish undo-tree-mode
    :config
    (progn
      (global-undo-tree-mode)
      (setq undo-tree-visualizer-timestamps t)
      (setq undo-tree-visualizer-diff t)))
#+END_SRC

** Editing modes
*** Semantic support
**** lsp-mode
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package lsp-mode
    :straight t
    :diminish
    :after rustic
    :init
    ;; set prefix for lsp-command-keymap (few alternatives - "C-l", "C-c l")
    (setq lsp-keymap-prefix "C-c l")
    :hook ((c++-mode . lsp)
           (python-mode . lsp)
           (c-mode . lsp)
           ;; if you want which-key integration
           (lsp-mode . lsp-enable-which-key-integration))
    :commands lsp
    :custom
    (lsp-rust-analyzer-cargo-watch-command "clippy")
    (lsp-eldoc-render-all t)
    (lsp-idle-delay 0.6)
    ;; enable / disable the hints as you prefer:
    (lsp-rust-analyzer-server-display-inlay-hints t)
    (lsp-rust-analyzer-display-lifetime-elision-hints-enable "skip_trivial")
    (lsp-rust-analyzer-display-chaining-hints t)
    (lsp-rust-analyzer-display-lifetime-elision-hints-use-parameter-names nil)
    (lsp-rust-analyzer-display-closure-return-type-hints t)
    (lsp-rust-analyzer-display-parameter-hints nil)
    (lsp-rust-analyzer-display-reborrow-hints nil)
    :config
    (add-hook 'lsp-mode-hook 'lsp-ui-mode))

  (use-package lsp-ui
    :straight t
    :commands lsp-ui-mode
    :custom
    (lsp-ui-peek-always-show t)
    (lsp-ui-sideline-show-hover t)
    (lsp-ui-doc-enable nil))
#+END_SRC
*** Tree-sitter
// #+BEGIN_SRC emacs-lisp :tangle yes
  // (use-package tree-sitter
  //   :straight t
  //   :init
  //   (global-tree-sitter-mode))
  // (use-package tree-sitter-langs
  //   :straight t)
// #+END_SRC
*** Literate programming
**** Editing source code
I don't want to get distracted by the same code in the other window, so I want org src to use the current window.

#+begin_src emacs-lisp :tangle yes
  (setq org-src-window-setup 'current-window)
#+end_src

**** Copying and sharing code

#+begin_src emacs-lisp :tangle yes
  (defun my/copy-code-as-org-block-and-gist (beg end)
    (interactive "r")
    (let ((filename (file-name-base))
          (mode (symbol-name major-mode))
          (contents
           (if (use-region-p) (buffer-substring beg end) (buffer-string)))
          (gist (if (use-region-p) (gist-region beg end) (gist-buffer))))
      (kill-new
       (format "\n[[%s][Gist: %s]]\n#+begin_src %s\n%s\n#+end_src\n"
               (oref (oref gist :data) :html-url) filename
               (replace-regexp-in-string "-mode$" "" mode)
               contents))))
#+end_src

*** Tab width of 2
#+begin_src emacs-lisp :tangle yes
  (setq-default tab-width 2)
#+end_src

*** Never use tabs
#+begin_src emacs-lisp :tangle yes
  (setq-default indent-tabs-mode nil)
#+end_src

