.emacs.d/jds-config.org
*** Compilation

Use C-c C-m to compile

#+begin_src emacs-lisp :tangle yes
  (use-package compile
    :straight t
    :init (progn
	    (add-hook 'c-mode-common-hook (lambda () (local-set-key "\C-c\C-m" 'compile)))
	    (add-hook 'fortran-mode-hook (lambda () (local-set-key "\C-c\C-m" 'compile)))
	    (add-hook 'f90-mode-hook (lambda () (local-set-key "\C-c\C-m" 'compile)))
	    (add-hook 'makefile-gmake-mode-hook (lambda () (local-set-key "\C-c\C-m" 'compile)))
	    (add-hook 'compilation-mode-hook (lambda () (local-set-key "\C-c\C-m" 'compile))))
    (setq compilation-scroll-output 'first-error))
#+end_src

Add a hydra for navigating compilation logs

#+begin_src emacs-lisp :tangle yes
  (defhydra hydra-next-error
    (global-map "C-x")
    "
  Compilation errors:
  _j_: next error        _h_: first error    _q_uit
  _k_: previous error    _l_: last error
  "
    ("`" next-error     nil)
    ("j" next-error     nil :bind nil)
    ("k" previous-error nil :bind nil)
    ("h" first-error    nil :bind nil)
    ("l" (condition-case err
             (while t
               (next-error))
           (user-error nil))
     nil :bind nil)
    ("q" nil            nil :color blue))
#+end_src

*** LaTeX
#+begin_src emacs-lisp :tangle yes
  (use-package auctex
    :straight t
    :defer t
    :config (progn (setq TeX-PDF-mode t)
		   (add-hook 'LaTeX-mode-hook '(lambda () (flyspell-mode 1)))))
#+end_src
*** Common Lisp
#+begin_src emacs-lisp :tangle yes
  (use-package slime
    :straight t
    :config (setq slime-contribs '(slime-fancy)
		  inferior-lisp-program "/usr/bin/sbcl"))
#+end_src
*** Elisp
#+begin_src emacs-lisp :tangle yes
  (defun my/eval-and-replace ()
    "Replace the preceding sexp with its value."
    (interactive)
    (backward-kill-sexp)
    (condition-case nil
        (prin1 (eval (read (current-kill 0)))
               (current-buffer))
      (error (message "Invalid expression")
             (insert (current-kill 0)))))

  (global-set-key (kbd "C-x C-e") 'my/eval-and-replace)
#+end_src
*** Python
#+begin_src emacs-lisp :tangle yes
  (setq python-python-command "python3.10")
  (setq python-shell-interpreter "python3.10")
#+end_src
**** Python lsp-mode
#+begin_src emacs-lisp :tangle yes
  (use-package lsp-pyright
    :straight t
    :after lsp-mode
    :custom
    (lsp-pyright-auto-import-completions nil)
    (lsp-pyright-typechecking-mode "off"))
#+end_src
*** Rust
#+begin_src emacs-lisp :tangle yes
  (use-package rustic
    :straight t
    :bind (:map rustic-mode-map
                ("M-j" . lsp-ui-imenu)
                ("M-?" . lsp-find-references)
                ("C-c C-c l" . flycheck-list-errors)
                ("C-c C-c a" . lsp-execute-code-action)
                ("C-c C-c r" . lsp-rename)
                ("C-c C-c q" . lsp-workspace-restart)
                ("C-c C-c Q" . lsp-workspace-shutdown)
                ("C-c C-c s" . lsp-rust-analyzer-status))
    :custom
    (setq rustic-lsp-server 'rust-analyzer)
    (setq rustic-analyzer-command '("rustup run stable rust-analyzer"))
    :config
    (setq rustic-format-on-save t))
#+end_src
*** Fortran
#+begin_src emacs-lisp :tangle yes
  (setq fortran-comment-region "!"
        fortran-line-length 200)
#+end_src
*** Markdown
#+begin_src emacs-lisp :tangle yes
  (use-package pandoc-mode
    :straight t)
  (use-package markdown-mode
    :straight t
    :init (progn
	    (add-hook 'markdown-mode-hook 'pandoc-mode)))
#+end_src
*** C programming

New modern C setup!

#+begin_src emacs-lisp :tangle yes
  (setq c-default-style "bsd"
        c-basic-offset 2
        indent-tabs-mode nil)

  (c-set-offset 'cpp-macro 0 nil)

  (add-hook 'c++-mode-hook '(lambda ()
                              (define-key c++-mode-map "\C-cf" 'align-current)))

  (add-hook 'c-mode-hook '(lambda ()
                            (define-key c-mode-map "\C-cf" 'align-current)))

  (add-hook 'c++-mode-hook '(lambda ()
                              (key-chord-define c++-mode-map ";;" "\C-e;")))

  (add-hook 'c-mode-hook '(lambda ()
                            (key-chord-define c++-mode-map ";;" "\C-e;")))
#+end_src

*** CUDA
#+begin_src emacs-lisp :tangle yes
  (use-package cuda-mode
    :straight t
    :init (progn
	    (add-to-list 'auto-mode-alist '("\\.cuh\\'" . cuda-mode))))
#+end_src

*** PlantUML
#+begin_src emacs-lisp :tangle yes
  (use-package plantuml-mode
    :straight t
    :init (progn
	    (setq plantuml-executable-path "/usr/bin/plantuml")
	    (setq plantuml-default-exec-mode 'executable)))
#+end_src

*** Lua
#+begin_src emacs-lisp :tangle yes
  (use-package lua-mode
    :straight t
    :config (add-to-list 'auto-mode-alist '("\\.lua$" . lua-mode)))
#+end_src

* Back Matter

They say you need this:

#+begin_src emacs-lisp :tangle yes
  (provide 'dot-emacs)
  ;;; dot-emacs ends here
#+end_src
