.emacs.d/jds-config.el

(use-package compile
  :straight t
  :init (progn
	  (add-hook 'c-mode-common-hook (lambda () (local-set-key "\C-c\C-m" 'compile)))
	  (add-hook 'fortran-mode-hook (lambda () (local-set-key "\C-c\C-m" 'compile)))
	  (add-hook 'f90-mode-hook (lambda () (local-set-key "\C-c\C-m" 'compile)))
	  (add-hook 'makefile-gmake-mode-hook (lambda () (local-set-key "\C-c\C-m" 'compile)))
	  (add-hook 'compilation-mode-hook (lambda () (local-set-key "\C-c\C-m" 'compile))))
  (setq compilation-scroll-output 'first-error))

(defhydra hydra-next-error
  (global-map "C-x")
  "
Compilation errors:
_j_: next error        _h_: first error    _q_uit
_k_: previous error    _l_: last error
"
  ("`" next-error     nil)
  ("j" next-error     nil :bind nil)
  ("k" previous-error nil :bind nil)
  ("h" first-error    nil :bind nil)
  ("l" (condition-case err
           (while t
             (next-error))
         (user-error nil))
   nil :bind nil)
  ("q" nil            nil :color blue))

(use-package auctex
  :straight t
  :defer t
  :config (progn (setq TeX-PDF-mode t)
		 (add-hook 'LaTeX-mode-hook '(lambda () (flyspell-mode 1)))))

(use-package slime
  :straight t
  :config (setq slime-contribs '(slime-fancy)
		inferior-lisp-program "/usr/bin/sbcl"))

(defun my/eval-and-replace ()
  "Replace the preceding sexp with its value."
  (interactive)
  (backward-kill-sexp)
  (condition-case nil
      (prin1 (eval (read (current-kill 0)))
             (current-buffer))
    (error (message "Invalid expression")
           (insert (current-kill 0)))))

(global-set-key (kbd "C-x C-e") 'my/eval-and-replace)

(setq python-python-command "python3.10")
(setq python-shell-interpreter "python3.10")

(use-package lsp-pyright
  :straight t
  :after lsp-mode
  :custom
  (lsp-pyright-auto-import-completions nil)
  (lsp-pyright-typechecking-mode "off"))

(use-package rustic
  :straight t)

(setq fortran-comment-region "!"
      fortran-line-length 200)

(use-package pandoc-mode
  :straight t)
(use-package markdown-mode
  :straight t
  :init (progn
	  (add-hook 'markdown-mode-hook 'pandoc-mode)))

(setq c-default-style "bsd"
      c-basic-offset 2
      indent-tabs-mode nil)

(c-set-offset 'cpp-macro 0 nil)

(add-hook 'c++-mode-hook '(lambda ()
                            (define-key c++-mode-map "\C-cf" 'align-current)))

(add-hook 'c-mode-hook '(lambda ()
                          (define-key c-mode-map "\C-cf" 'align-current)))

(add-hook 'c++-mode-hook '(lambda ()
                            (key-chord-define c++-mode-map ";;" "\C-e;")))

(add-hook 'c-mode-hook '(lambda ()
                          (key-chord-define c++-mode-map ";;" "\C-e;")))

(use-package cuda-mode
  :straight t
  :init (progn
	  (add-to-list 'auto-mode-alist '("\\.cuh\\'" . cuda-mode))))

(use-package plantuml-mode
  :straight t
  :init (progn
	  (setq plantuml-executable-path "/usr/bin/plantuml")
	  (setq plantuml-default-exec-mode 'executable)))

(use-package lua-mode
  :straight t
  :config (add-to-list 'auto-mode-alist '("\\.lua$" . lua-mode)))

(provide 'dot-emacs)
;;; dot-emacs ends here
